from kns import tokenize

print(
  tokenize(
    "សូមជម្រាបថាលោកស៊ីយ៉េដយូសាហ្វរ៉ាសាហ្គីឡានី(SyedYusufRazaGillani)ប្រធានព្រឹទ្ធសភាប៉ាគីស្ថាននិងជាប្រធានស្ថាបនិកនៃសន្និសីទប្រធានសភានៃអន្តរសភា(ISC)នឹងត្រូវបំពេញទស្សនកិច្ចផ្លូវការនៅកម្ពុជាចាប់ពីថ្ងៃទី២ដល់ថ្ងៃទី៥ខែកុម្ភៈឆ្នាំ២០២៦។ក្រៅពីជំនួបទ្វេភាគីជាមួយសម្តេចហ៊ុនសែនប្រធានព្រឹទ្ធសភាកម្ពុជាក្នុងដំណើរទស្សនកិច្ចនេះលោកស៊ីយ៉េដយូសាហ្វរ៉ាសាហ្គីឡានីនិងគណៈប្រតិភូនឹងអញ្ជើញចូលក្រាបបង្គំគាល់ព្រះករុណាព្រះបាទសម្តេចព្រះបរមនាថនរោត្តមសីហមុនីព្រះមហាក្សត្រកម្ពុជានិងជួបសម្ដែងការគួរសមចំពោះសម្តេចឃួនសុដារីប្រធានរដ្ឋសភាកម្ពុជានិងសម្តេចហ៊ុនម៉ាណែតនាយករដ្ឋមន្ត្រីកម្ពុជា។"
  )
)
